<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"a24b4f78091a0fb1cac4728bc463380fbdf34e3baa3dfc09577c4b65a8c67981","plan_job_ref":"Job Environment Main - Plan #420 at https://github.com/jarrod-lowe/wildsea/actions/runs/11412671615","plan_out_hash":"6776efa6e6e053350a041450cdcb05aa20c9c2d9d913029142fbb4a132d4ee05","plan_hash":"b5f8ae67f56c6530905ceaec860e6f33fa91c55d582e3ef73a288ba36b1cb574","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # module.wildsea.aws_cloudformation_stack.delete_action will be destroyed
  # (because aws_cloudformation_stack.delete_action is not in configuration)
-   resource "aws_cloudformation_stack" "delete_action" {
-       disable_rollback   = false -> null
-       id                 = "arn:aws:cloudformation:ap-southeast-2:021891603679:stack/Wildsea-primary-delete-actions/f6b17b40-8881-11ef-8586-06c3eaa4167b" -> null
-       name               = "Wildsea-primary-delete-actions" -> null
-       outputs            = {} -> null
-       parameters         = {} -> null
-       tags               = {} -> null
-       tags_all           = {
-           "Application" = "Wildsea-primary"
        } -> null
-       template_body      = jsonencode(
            {
-               AWSTemplateFormatVersion = "2010-09-09"
-               Resources                = {
-                   DeletePlayerRule = {
-                       Properties = {
-                           Description  = "Delete players on deleted game"
-                           EventBusName = "Wildsea-primary"
-                           EventPattern = jsonencode(
                                {
-                                   detail-type = [
-                                       "DeletePlayer",
                                    ]
-                                   source      = [
-                                       "wildsea.table",
                                    ]
                                }
                            )
-                           Name         = "Wildsea-primary-delete-player"
-                           State        = "ENABLED"
-                           Targets      = [
-                               {
-                                   AppSyncParameters = {
-                                       GraphQLOperation = <<-EOT
                                            mutation DeletePlayerBackground($input: DeletePlayerInput!) {
                                                deletePlayer(input: $input) {
                                                    gameId
                                                    userId
                                                    deleted
                                                }
                                            }
                                        EOT
                                    }
-                                   Arn               = "arn:aws:appsync:ap-southeast-2:021891603679:endpoints/graphql-api/2xdx2rdnwjbyznwjz4nc54dzbi"
-                                   Id                = "DeletePlayer"
-                                   InputTransformer  = {
-                                       InputPathsMap = {
-                                           gameId = "$.detail.gameId"
-                                           userId = "$.detail.userId"
                                        }
-                                       InputTemplate = jsonencode(
                                            {
-                                               input = {
-                                                   gameId = "<gameId>"
-                                                   userId = "<userId>"
                                                }
                                            }
                                        )
                                    }
-                                   RoleArn           = "arn:aws:iam::021891603679:role/Wildsea-primary-deleter-bus"
                                },
                            ]
                        }
-                       Type       = "AWS::Events::Rule"
                    }
                }
            }
        ) -> null
-       timeout_in_minutes = 0 -> null
#        (1 unchanged attribute hidden)
    }

  # module.wildsea.aws_cloudwatch_event_rule.delete_rule will be created
+   resource "aws_cloudwatch_event_rule" "delete_rule" {
+       arn            = (known after apply)
+       description    = "Delete players on deleted game"
+       event_bus_name = "Wildsea-primary"
+       event_pattern  = jsonencode(
            {
+               detail-type = [
+                   "DeletePlayer",
                ]
+               source      = [
+                   "wildsea.table",
                ]
            }
        )
+       force_destroy  = false
+       id             = (known after apply)
+       name           = "Wildsea-primary-delete-player"
+       name_prefix    = (known after apply)
+       state          = "ENABLED"
+       tags_all       = {
+           "Application" = "Wildsea-primary"
        }
    }

  # module.wildsea.aws_cloudwatch_event_target.delete_target will be created
+   resource "aws_cloudwatch_event_target" "delete_target" {
+       arn            = "arn:aws:appsync:ap-southeast-2:021891603679:endpoints/graphql-api/2xdx2rdnwjbyznwjz4nc54dzbi"
+       event_bus_name = "Wildsea-primary"
+       force_destroy  = false
+       id             = (known after apply)
+       role_arn       = "arn:aws:iam::021891603679:role/Wildsea-primary-deleter-bus"
+       rule           = "Wildsea-primary-delete-player"
+       target_id      = "*********************"

+       appsync_target {
+           graphql_operation = <<-EOT
                mutation DeletePlayerBackground($input: DeletePlayerInput!) {
                    deletePlayer(input: $input) {
                        gameId
                        userId
                        deleted
                    }
                }
            EOT
        }

+       input_transformer {
+           input_paths    = {
+               "gameId" = "$.detail.gameId"
+               "userId" = "$.detail.userId"
            }
+           input_template = jsonencode(
                {
+                   input = {
+                       gameId = "<gameId>"
+                       userId = "<userId>"
                    }
                }
            )
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #420](https://github.com/jarrod-lowe/wildsea/actions/runs/11412671615)